# Pandas Basics

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [7]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[20,30,40,50],[39,49,59,69],[12,13,15,88]], columns = ['A','B','C','D'])

In [8]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2  20  30  40  50
3  39  49  59  69
4  12  13  15  88

In [9]:
df1.head(3)

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2  20  30  40  50

In [10]:
df1.tail(2)

    A   B   C   D
3  39  49  59  69
4  12  13  15  88

In [11]:
df1.shape

(5, 4)

## Slicing in Pandas

In [12]:
df1.iloc[0:2,1:3]

   B  C
0  2  3
1  6  7

# Reading A CSV File in Pandas

In [13]:
import pandas as pd
import numpy as np

In [14]:
_df = pd.read_csv("Data.csv")

In [16]:
_df.head()

         Date   Open   High    Low  Close  Volume
0  04/15/2024  24.44  24.90  23.98  24.07  73,650
1  04/12/2024  24.51  24.66  24.19  24.24  49,089
2  04/11/2024  24.40  24.71  24.25  24.69  80,855
3  04/10/2024  24.68  24.73  23.90  24.19  96,568
4  04/09/2024  25.50  25.57  25.11  25.26  62,897

# Exporting A CSV File in Pandas

In [17]:
import pandas as pd
import numpy as np

In [18]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[20,30,40,50],[39,49,59,69],[12,13,15,88]], columns = ['A','B','C','D'])

In [20]:
df1.head()

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2  20  30  40  50
3  39  49  59  69
4  12  13  15  88

In [ ]:
df1.to_csv("Export.csv",Index="False")